---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetRuleName(System.Int32)
source: html/9bcfc27c-377b-0b13-7bd5-7d5bab1a3bae.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetRuleName Method

Retrieves the name of the rule.

## Syntax (C#)
```csharp
public string GetRuleName(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The rule index to get information for.

## Returns
The name of the rule.